Revit 2026 API

# ParameterDissociateFromGlobalParameter Method

---

Dissociates this parameter from a global parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DissociateFromGlobalParameter()
```
```vb
Public Sub DissociateFromGlobalParameter
```
```cpp
public:
void DissociateFromGlobalParameter()
```
```fsharp
member DissociateFromGlobalParameter : unit -> unit
```

| Exception | Condition |
| --- | --- |
| ArgumentException | This parameter does not exist in the document anymore. -or- This parameter is either not parameterizable or does not match the type of the global parameter. |

It is assumed this parameter has been previously associated with the global parameter by using the [!:AssociateWithGlobalParameter(Revit::DB::ElementId^)] method.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace